### Defining a # pandas Series

In [14]:
import pandas as pd

purchase_1=pd.Series({'Name':'chris',
                      'item_purschased':'Dog food',
                     'cost':22.50})
purchase_2=pd.Series({'Name':'Keyvn',
                      'item_purschased':'kitty litter',
                     'cost':2.50})
purchase_3=pd.Series({'Name':'Vinod',
                      'item_purschased':'bird seed',
                     'cost':5.0})

### converting a series to form a Pandas DataFrame

In [15]:
df=pd.DataFrame([purchase_1,purchase_2,purchase_3],index=['store1','store1','store2'])

In [16]:
df

         Name item_purschased  cost
store1  chris        Dog food  22.5
store1  Keyvn    kitty litter   2.5
store2  Vinod       bird seed   5.0

### Selecting data using loc

In [17]:
df.loc['store2']

Name                   Vinod
item_purschased    bird seed
cost                       5
Name: store2, dtype: object

In [18]:
df.loc['store1']

         Name item_purschased  cost
store1  chris        Dog food  22.5
store1  Keyvn    kitty litter   2.5

### checking the data type using python data type function

In [19]:
type(df.loc['store2'])

pandas.core.series.Series

### if we want to know only the cost of store1

In [20]:
df.loc['store1','cost']

store1    22.5
store1     2.5
Name: cost, dtype: float64

## what if we want to do a column selection

#### Method 1: transforming Row to column  and then using loc[ ]

In [21]:
df.T

                   store1        store1     store2
Name                chris         Keyvn      Vinod
item_purschased  Dog food  kitty litter  bird seed
cost                 22.5           2.5          5

In [23]:
df.T.loc['cost']

store1    22.5
store1     2.5
store2       5
Name: cost, dtype: object

#### method2: Direct column selection usinf direct indexing operator

In [25]:
df['cost']

store1    22.5
store1     2.5
store2     5.0
Name: cost, dtype: float64

### Chaining operation

Chaining tends to cause copy of dataFrame .. thats why chaining is slow and we must avoid it

In [35]:
df.loc['store1']['cost']

store1    22.5
store1     2.5
Name: cost, dtype: float64

### we should slice data using loc[:]   chaining could be source of error

because Chaining tends to cause copy of dataFrame .. thats why chaining is slow

In [40]:
df.loc[:,['cost','item_purschased']]

        cost item_purschased
store1  22.5        Dog food
store1   2.5    kitty litter
store2   5.0       bird seed

In [50]:
df.iloc[1:,1:3]

       item_purschased  cost
store1    kitty litter   2.5
store2       bird seed   5.0

##  Dropping Data in dataFrame

#### Method#1 using drop function we drop a row (Indirect method)

In [107]:
df.drop('store1')

         Name item_purschased  cost Location
store2  Vinod       bird seed   5.0     None

In [108]:
# orignal data frame is not affected by drop because  does not do inplace changes 

df

         Name item_purschased  cost Location
store1  chris        Dog food  22.5     None
store1  Keyvn    kitty litter   2.5     None
store2  Vinod       bird seed   5.0     None

In [116]:
copy_df=df.copy()
copy_df

         Name item_purschased  cost Location
store1  chris        Dog food  22.5     None
store1  Keyvn    kitty litter   2.5     None
store2  Vinod       bird seed   5.0     None

In [110]:
copy_df=copy_df.drop('store2')
copy_df

         Name item_purschased  cost Location
store1  chris        Dog food  22.5     None
store1  Keyvn    kitty litter   2.5     None

In [111]:
copy_df

         Name item_purschased  cost Location
store1  chris        Dog food  22.5     None
store1  Keyvn    kitty litter   2.5     None

###  Inplace  and  axis attributes of Drop

by default axis=0 for rows, you can change it column by changing value to axis to 1

In [112]:
copy_df.drop('store1',inplace=True)
copy_df

C:\ProgramData\Anaconda6\lib\site-packages\pandas\core\frame.py:3694: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  errors=errors)

Empty DataFrame
Columns: [Name, item_purschased, cost, Location]
Index: []

In [113]:
copy_df.drop('Location',axis=1)
copy_df

Empty DataFrame
Columns: [Name, item_purschased, cost, Location]
Index: []

In [114]:
copy_df

Empty DataFrame
Columns: [Name, item_purschased, cost, Location]
Index: []

### Method #2 using a del key word ( to drop a column directly)

In [117]:
del copy_df['Name']
copy_df

       item_purschased  cost Location
store1        Dog food  22.5     None
store1    kitty litter   2.5     None
store2       bird seed   5.0     None

### Adding a New column to DataFrame

 for example if we want to add a column to a dataFrame we can do so by assigning column a value

In [122]:
df['Location']=None

In [124]:
df

         Name item_purschased  cost Location
store1  chris        Dog food  22.5     None
store1  Keyvn    kitty litter   2.5     None
store2  Vinod       bird seed   5.0     None